import matplotlib.pyplot as plt

# Данные
x_Pm3m = [-5.00, -4.00, -3.00, -2.00, -1.00, 0.00, 1.00, 2.00, 3.00, 4.00, 5.00]
y_Pm3m = [-199.154365510 / 4, -199.828844700 / 4, -200.325823990 / 4, -200.662947640 / 4, -200.855441340 / 4,
          -200.918217210 / 4, -200.863757400 / 4, -200.702980610 / 4, -200.445338970 / 4, -200.099874900 / 4,
          -199.674896790 / 4]

x_I4mcm = [-4.00, -3.00, -2.00, -1.00, 0.00]
y_I4mcm = [-200.452058710 / 4, -200.757925970 / 4, -200.954226470 / 4, -201.045665460 / 4, -201.038566180 / 4]

x_P4mm = [-7.00, -6.00, -5.00, -4.00, -3.00]
y_P4mm = [-197.190802750 / 4, -198.282074680 / 4, -199.154368500 / 4, -200.045531570 / 4, -200.325824900 / 4]

x_Pnma = [0.00, 2.00, 3.00]
y_Pnma = [-201.054758800 / 4, -200.846488470 / 4, -200.590858390 / 4]

x_Pmc2_1 = [4.00, 6.00]
y_Pmc2_1 = [-200.499384690 / 4, -200.021994460 / 4]

x_I4cm = [-7.00, -6.00, -5.00, -4.00, -3.00, -2.00]
y_I4cm = [-198.999296580 / 4, -199.554215420 / 4, -200.042120230 / 4, -200.452065350 / 4, -200.757927730 / 4,
          -200.954228970 / 4]

x_Ima2 = [0.00, 1.00, 2.00, 3.00, 4.00, 5.00, 6.00, 7.00]
y_Ima2 = [-201.038565010 / 4, -200.937097030 / 4, -200.784318220 / 4, -200.600821300 / 4, -200.390629910 / 4,
          -200.158382640 / 4, -199.909399670 / 4, -199.649103970 / 4]

# Построение графиков
plt.figure(figsize=(7, 6))

plt.plot(x_Pm3m, y_Pm3m, marker='o', label="P4/mmm")
plt.plot(x_I4mcm, y_I4mcm, marker='o', label="I4/mcm (a0a0c-)")
plt.plot(x_P4mm, y_P4mm, marker='o', label="P4mm")
plt.plot(x_Pnma, y_Pnma, marker='o', label="Pnma")
plt.plot(x_Pmc2_1, y_Pmc2_1, marker='o', label="Pmc2_1")
plt.plot(x_I4cm , y_I4cm, marker='o', label="I4cm")
plt.plot(x_Ima2, y_Ima2, marker='o', label="Ima2")
# Настройка графика
plt.title("Biaxial")
plt.xlabel("Biaxial strain (%)", fontsize=14)
plt.ylabel("Energy (eV)", fontsize=14)
plt.tick_params(axis='both', direction='in', labelsize=12)
plt.legend()
plt.grid(True)

# Показ графика
plt.show()
