import matplotlib.pyplot as plt

# Данные
x_Pm3m = range(0, 11)
y_Pm3m = [-200.918270340 / 4, -200.898029310 / 4, -200.837320370 / 4, -200.739733950 / 4, -200.609502880 / 4, -200.450159380 / 4,
        -200.264782980 / 4, -200.056426620 / 4, -199.827642980 / 4, -199.580334690 / 4, -199.317499170 / 4]

x_I4mcm = [0.00, 3.00, 6.00, 7.00, 8.00, 9.00, 10.00]
y_I4mcm = [-201.049690720 / 4, -201.023564620 / 4, -200.575824320 / 4, -200.398323900 / 4, -200.199599690 / 4, -199.981883460 / 4,
           -199.770304080 / 4]

x_P4mbm = [0.00, 1.00, 2.00, 3.00, 8.00, 9.00, 10.00]
y_P4mbm = [-200.935420210 / 4, -200.929710560 / 4, -200.895335580 / 4, -200.817204630 / 4, -200.064352120 / 4, -199.851633530 / 4,
           -199.644605040 / 4]

x_Imma = [2.00, 5.00, 6.00, 8.00]
y_Imma = [-201.023555270 / 4, -200.729709800 / 4, -200.575805510 / 4, -200.199598930 / 4]

x_C2m = [0.00, 1.00, 2.00, 3.00, 10.00]
y_C2m = [-201.057920040 / 4, -201.054818510 / 4, -201.023559140 / 4, -200.956618150 / 4, -199.770302340  / 4]

# Построение графиков
plt.figure(figsize=(7, 6))

plt.plot(x_Pm3m, y_Pm3m, marker='o', label="P4/mmm")
plt.plot(x_I4mcm, y_I4mcm, marker='o', label="I4/mcm (a0a0c-)")
plt.plot(x_P4mbm, y_P4mbm, marker='o', label="P4/mbm (a0a0c+)")
plt.plot(x_Imma, y_Imma, marker='o', label="Imma -> C2/m")
plt.plot(x_C2m, y_C2m, marker='o', label="C2m (a0b-c-)")

# Настройка графика
plt.title("Uniaxial")
plt.xlabel("Uniaxial strain (%)", fontsize=14)
plt.ylabel("Energy (eV)", fontsize=14)
plt.tick_params(axis='both', direction='in', labelsize=12)
plt.legend()
plt.grid(True)

# Показ графика
plt.show()
